Reports/20190924_113239/TestSuiteAPIDemo/20190924_113239/requests/main/2.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2019-09-24T06:03:05.366Z",
      "request" : {
        "method" : "SOAP12",
        "url" : "http://www.thomas-bayer.com/axis2/services/BLZService?wsdl",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "queryString" : [ {
          "name" : "wsdl",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "application/octet-stream",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <getBank xmlns=\"http://thomas-bayer.com/blz/\">\n            <blz>50230000</blz>\n        </getBank>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "content" : {
          "size" : 438,
          "mimeType" : "application/xml",
          "text" : "<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"><soapenv:Body><ns1:getBankResponse xmlns:ns1=\"http://thomas-bayer.com/blz/\"><ns1:details><ns1:bezeichnung>ABC International Bank Frankfurt am Main</ns1:bezeichnung><ns1:bic>ABCADEFFXXX</ns1:bic><ns1:ort>Frankfurt am Main</ns1:ort><ns1:plz>60325</ns1:plz></ns1:details></ns1:getBankResponse></soapenv:Body></soapenv:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 107,
        "bodySize" : 438,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "connect" : 995,
        "receive" : 0,
        "wait" : 0,
        "send" : 0,
        "blocked" : -1,
        "dns" : -1
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "2",
        "testObjectId" : "Object Repository/SOAP12/getBank",
        "harId" : "9cd1fadd-fd5f-4601-bf03-689db55507ff",
        "reportFolder" : null
      },
      "time" : 995
    } ],
    "comment" : ""
  }
}